app/controllers/admin/posts_controller.rb

INSERT INTO `posts` (`created_at`, `title`, `updated_at`, `content`) VALUES('2009-08-09 12:47:50', 'create todo app in appengine', '2009-08-09 12:47:50', '@@@\r\n hello\r\n@@@')
---
  def create
    @post = Post.new(params[:post])

    if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 6)
UPDATE `posts` SET `content` = '@@@\r\n from django.conf.urls.defaults import *\r\n\r\n@@@', `updated_at` = '2009-08-09 12:48:31' WHERE `id` = 6
---
  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(params[:post])