app/controllers/posts_controller.rb

  def comment
    @post = Post.find(params[:id])
    comment = Comment.new(params[:comment])
    if comment.save
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `comments` (`name`, `created_at`, `updated_at`, `post_id`, `url`, `content`, `email`) VALUES('roc yu ', '2009-10-19 12:48:09', '2009-10-19 12:48:09', NULL, 'rojo.im', 'hello ', 'rociiu@mac.com')